---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TableCellCalculatedValueData Properties
TableCellCalculatedValueData Class See Also Send Feedback
---

The TableCellCalculatedValueData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TableCellCalculatedValueData Class

Autodesk.Revit.DB Namespace